app/controllers/musicals_controller.rb

SELECT "musicals".* FROM "musicals"
---
  def index
    @musicals = Musical.all

SELECT "musicals".* FROM "musicals" WHERE "musicals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_musical
      @musical = Musical.find(params[:id])