app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("show_seen", "rating", "created_at", "updated_at", "musical_id", "reviewer_name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["show_seen", "Moulin Rouge! the Musical"], ["rating", 5], ["created_at", "2020-05-18 03:00:28.057126"], ["updated_at", "2020-05-18 03:00:28.057126"], ["musical_id", 1], ["reviewer_name", "Erica"]]
---
  def create
    puts review_params
    @review = Review.new(review_params)
    @review.musical_id = params[:musical_id]
    @review.date_of_show = Date.strptime(review_params[:date_of_show], '%m-%d-%Y')

    if @review.save

UPDATE "reviews" SET "show_seen" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["show_seen", "Moulin Rouge! the Musical"], ["updated_at", "2020-05-18 02:47:01.175210"], ["id", 1]]
---
  def update
    if @review.update(review_params)